bugs fixed. Readme updated.
